Revit 2027 API
View.GetDirectContext3DHandleOverrides Method
 Returns DirectContext3D handle overrides object for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectContext3DHandleOverrides GetDirectContext3DHandleOverrides()
Public Function GetDirectContext3DHandleOverrides As DirectContext3DHandleOverrides
public:
DirectContext3DHandleOverrides^ GetDirectContext3DHandleOverrides()
member GetDirectContext3DHandleOverrides : unit -> DirectContext3DHandleOverrides
Return Value
DirectContext3DHandleOverrides
 DirectContext3D handle overrides for the view
See Also
Reference
View Class
Autodesk.Revit.DB Namespace